/* Search criteria for other date properties of a file, such as when a photograph was taken, within a specific period before today */
"%@ %[Any Date]@" = "%1$@ %2$[任何日期]@";
"%@ %[Today]@" = "%1$@ %2$[今天]@";
"%@ %[Since Yesterday]@" = "%1$@ %2$[从昨天起]@";
"%@ %[This week]@" = "%1$@ %2$[本周]@";
"%@ %[Within Last 2 weeks]@" = "%1$@ %2$[过去 2 周内]@";
"%@ %[This month]@" = "%1$@ %2$[本月]@";
"%@ %[Within Last 2 months]@" = "%1$@ %2$[过去 2 个月内]@";

/* Search criteria for other boolean properties of a file, such as whether red-eye correction was on */
"%@ %[Any]@" = "%1$@ %2$[任何]@";
"%@ %[Yes]@" = "%1$@ %2$[是]@";
"%@ %[No]@" = "%1$@ %2$[否]@";

/* Search criteria for other string properties of a file, such as the name of the author */
"%@ %[Contains]@ %@" = "%1$@ %2$[含有]@ %3$@";
"%@ %[Begins With]@ %@" = "%1$@ %2$[开头为]@ %3$@";
"%@ %[Ends With]@ %@" = "%1$@ %2$[结尾为]@ %3$@";
"%@ %[Is]@ %@" = "%1$@ %2$[是]@ %3$@";

/* Search criteria for other date properties of a file, such as when a photograph was taken, on a specific date */
"%@ %[Exactly]@ %@" = "%1$@ %2$[是]@ %3$@";
"%@ %[Before]@ %@" = "%1$@ %2$[早于]@ %3$@";
"%@ %[After]@ %@" = "%1$@ %2$[晚于]@ %3$@";

/* Search criteria for other numerical properties of a file, such as the pixel height of an image */
"%@ %[Greater than]@ %@" = "%1$@ %2$[大于]@ %3$@";
"%@ %[Less than]@ %@" = "%1$@ %2$[少于]@ %3$@";

/* Search criteria for other date properties of a file, such as when a photograph was taken, within a user-specified period of time before today */
"%@ %[Within Last]@ %@ %[Days]@" = "%1$@ %2$[在过去]@ %3$@ %4$[天]@";
"%@ %[Within Last]@ %@ %[Weeks]@" = "%1$@ %2$[在过去]@ %3$@ %4$[周]@";
"%@ %[Within Last]@ %@ %[Months]@" = "%1$@ %2$[在过去]@ %3$@ %4$[个月]@";
"%@ %[Within Last]@ %@ %[Years]@" = "%1$@ %2$[在过去]@ %3$@ %4$[年]@";

/* Search criteria for other color space properties of a file */
"%[Color Space]@ %[Any Color Space]@" = "%1$[颜色空间]@ %2$[任何颜色空间]@";
"%[Color Space]@ %[RGB]@" = "%1$[颜色空间]@ %2$[RGB]@";
"%[Color Space]@ %[CMYK]@" = "%1$[颜色空间]@ %2$[CMYK]@";
"%[Color Space]@ %[Grayscale]@" = "%1$[颜色空间]@ %2$[灰度]@";

/* Search criteria for files by contents */
"%[Contents]@ contain %@" = "%1$[内容]@含有%2$@";

/* Search criteria for time duration - minutes and seconds */
"%[Duration]@ %[Greater than]@ %@ %[min]@ %@ %[sec]@" = "%1$[时间长度]@ %2$[大于]@ %3$@ %4$[分钟]@ %5$@ %6$[秒钟]@";
"%[Duration]@ %[Less than]@ %@ %[min]@ %@ %[sec]@" = "%1$[时间长度]@ %2$[小于]@ %3$@ %4$[分钟]@ %5$@ %6$[秒钟]@";

/* Search criteria for files by keyword */
"%[Keywords]@ %@" = "%1$[关键词]@ %2$@";

/* Search criteria for files by keyword containing */
"%[Keywords]@ contain %@" = "%1$[关键词]@含有%2$@";

/* Search criteria for specific kinds of files */
"%[Kind]@ is %[Any]@" = "%1$[种类]@是%2$[任意]@";
"%[Kind]@ is %[Images]@" = "%1$[种类]@是%2$[图像]@";
"%[Kind]@ is %[Text]@" = "%1$[种类]@是%2$[文本]@";
"%[Kind]@ is %[PDF]@" = "%1$[种类]@是 %2$[PDF]@";
"%[Kind]@ is %[Movies]@" = "%1$[种类]@是%2$[影片]@";
"%[Kind]@ is %[Music]@" = "%1$[种类]@是%2$[音乐]@";
"%[Kind]@ is %[Documents]@" = "%1$[种类]@是%2$[文稿]@";
"%[Kind]@ is %[Presentations]@" = "%1$[种类]@是%2$[演示文稿]@";
"%[Kind]@ is %[Folders]@" = "%1$[种类]@是%2$[文件夹]@";
"%[Kind]@ is %[Applications]@" = "%1$[种类]@是%2$[应用程序]@";

/* Search criteria for other kinds of files */
"%[Kind]@ is %[Others...]@ %@" = "%1$[种类]@是%2$[其他...]@ %3$@";

/* Search criteria for files by a particular label (color) */
"%[Label]@ is %@" = "%1$[标签]@是“%2$@”";

/* Search criteria for dates a fixed amount relative to today */
"%[Last Opened]@ %[Any Date]@" = "%1$[上一次打开日期]@ %2$[任何日期]@";
"%[Last Modified]@ %[Any Date]@" = "%1$[上一次修改日期]@ %2$[任何日期]@";
"%[Created]@ %[Any Date]@" = "%1$[创建日期]@ %2$[任何日期]@";
"%[Last Opened]@ %[Today]@" = "%1$[上一次打开日期]@ %2$[今天]@";
"%[Last Modified]@ %[Today]@" = "%1$[上一次修改日期]@ %2$[今天]@";
"%[Created]@ %[Today]@" = "%1$[创建日期]@ %2$[今天]@";
"%[Last Opened]@ %[Since Yesterday]@" = "%1$[上一次打开日期]@ %2$[从昨天开始]@";
"%[Last Modified]@ %[Since Yesterday]@" = "%1$[上一次修改日期]@ %2$[从昨天开始]@";
"%[Created]@ %[Since Yesterday]@" = "%1$[创建日期]@ %2$[从昨天开始]@";
"%[Last Opened]@ %[This week]@" = "%1$[上一次打开日期]@ %2$[本周]@";
"%[Last Modified]@ %[This week]@" = "%1$[上一次修改日期]@ %2$[本周]@";
"%[Created]@ %[This week]@" = "%1$[创建日期]@ %2$[本周]@";
"%[Last Opened]@ %[Within Last 2 weeks]@" = "%1$[上一次打开日期]@ %2$[过去 2 周内]@";
"%[Last Modified]@ %[Within Last 2 weeks]@" = "%1$[上一次修改日期]@ %2$[过去 2 周内]@";
"%[Created]@ %[Within Last 2 weeks]@" = "%1$[创建日期]@ %2$[过去 2 周内]@";
"%[Last Opened]@ %[This month]@" = "%1$[上一次打开日期]@ %2$[本月]@";
"%[Last Modified]@ %[This month]@" = "%1$[上一次修改日期]@ %2$[本月]@";
"%[Created]@ %[This month]@" = "%1$[创建日期]@ %2$[本月]@";
"%[Last Opened]@ %[Within Last 2 months]@" = "%1$[上一次打开日期]@ %2$[过去 2 个月内]@";
"%[Last Modified]@ %[Within Last 2 months]@" = "%1$[上一次修改日期]@ %2$[过去 2 个月内]@";
"%[Created]@ %[Within Last 2 months]@" = "%1$[创建日期]@ %2$[过去 2 个月内]@";

/* Search criteria for specific dates */
"%[Last Opened]@ %[Exactly]@ %@" = "%1$[上一次打开日期]@ %2$[是]@ %3$@";
"%[Last Modified]@ %[Exactly]@ %@" = "%1$[上一次修改日期]@ %2$[是]@ %3$@";
"%[Created]@ %[Exactly]@ %@" = "%1$[创建日期]@ %2$[是]@ %3$@";
"%[Last Opened]@ %[Before]@ %@" = "%1$[上一次打开日期]@ %2$[早于]@ %3$@";
"%[Last Modified]@ %[Before]@ %@" = "%1$[上一次修改日期]@ %2$[早于]@ %3$@";
"%[Created]@ %[Before]@ %@" = "%1$[创建日期]@ %2$[早于]@ %3$@";
"%[Last Opened]@ %[After]@ %@" = "%1$[上一次打开日期]@ %2$[晚于]@ %3$@";
"%[Last Modified]@ %[After]@ %@" = "%1$[上一次修改日期]@ %2$[晚于]@ %3$@";
"%[Created]@ %[After]@ %@" = "%1$[创建日期]@ %2$[晚于]@ %3$@";

/* Search criteria for dates a variable amount relative to today */
"%[Last Opened]@ %[Within Last]@ %@ %[Days]@" = "%1$[上一次打开日期]@ %2$[在过去]@ %3$@ %4$[天]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Days]@" = "%1$[上一次修改日期]@ %2$[在过去]@ %3$@ %4$[天]@";
"%[Created]@ %[Within Last]@ %@ %[Days]@" = "%1$[创建日期]@ %2$[在过去]@ %3$@ %4$[天]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[上一次打开日期]@ %2$[在过去]@ %3$@ %4$[周]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[上一次修改日期]@ %2$[在过去]@ %3$@ %4$[周]@";
"%[Created]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[创建日期]@ %2$[在过去]@ %3$@ %4$[周]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Months]@" = "%1$[上一次打开日期]@ %2$[在过去]@ %3$@ %4$[个月]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Months]@" = "%1$[上一次修改日期]@ %2$[在过去]@ %3$@ %4$[个月]@";
"%[Created]@ %[Within Last]@ %@ %[Months]@" = "%1$[创建日期]@ %2$[在过去]@ %3$@ %4$[个月]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Years]@" = "%1$[上一次打开日期]@ %2$[在过去]@ %3$@ %4$[年]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Years]@" = "%1$[上一次修改日期]@ %2$[在过去]@ %3$@ %4$[年]@";
"%[Created]@ %[Within Last]@ %@ %[Years]@" = "%1$[创建日期]@ %2$[在过去]@ %3$@ %4$[年]@";

/* Search criteria for musical genre type */
"%[Musical genre]@ %@" = "%1$[音乐风格]@ %2$@";

/* Search criteria for name extension type */
"%[Name Extension]@ %@" = "%1$[扩展名]@ %2$@";

/* Search criteria for files by name */
"%[Name]@ %[Contains]@ %@" = "%1$[名称]@ %2$[包含]@ %3$@";
"%[Name]@ %[Begins With]@ %@" = "%1$[名称]@ %2$[开始为]@ %3$@";
"%[Name]@ %[Ends With]@ %@" = "%1$[名称]@ %2$[结束为]@ %3$@";
"%[Name]@ %[Is]@ %@" = "%1$[名称]@ %2$[是]@ %3$@";

/* Search criteria for other color space properties of a file */
"%[Orientation]@ %[Any Orientation]@" = "%1$[方向]@ %2$[任何方向]@";
"%[Orientation]@ %[Landscape]@" = "%1$[方向]@ %2$[横向]@";
"%[Orientation]@ %[Portrait]@" = "%1$[方向]@ %2$[纵向]@";

/* Menu item to bring up an additional list of search criteria */
"%[Other...]@" = "%[其他…]@";

/* Search criteria for raw query type */
"%[Raw query]@ %@" = "%1$[Raw 查询]@ %2$@";

/* Search criteria for generic search-by-all-fields type */
"%[Search for]@ %@" = "%1$[搜索]@ %2$@";

/* Search criteria for files larger or smaller than a specific number of kilobytes, megabytes, or gigabytes */
"%[Size]@ %[Greater than]@ %@ %[KB]@" = "%1$[大小]@ %2$[大于]@ %3$@ %4$[KB]@";
"%[Size]@ %[Less than]@ %@ %[KB]@" = "%1$[大小]@ %2$[小于]@ %3$@ %4$[KB]@";
"%[Size]@ %[Greater than]@ %@ %[MB]@" = "%1$[大小]@ %2$[大于]@ %3$@ %4$[MB]@";
"%[Size]@ %[Less than]@ %@ %[MB]@" = "%1$[大小]@ %2$[小于]@ %3$@ %4$[MB]@";
"%[Size]@ %[Greater than]@ %@ %[GB]@" = "%1$[大小]@ %2$[大于]@ %3$@ %4$[GB]@";
"%[Size]@ %[Less than]@ %@ %[GB]@" = "%1$[大小]@ %2$[小于]@ %3$@ %4$[GB]@";

/* Search criteria for other visibility properties of a file */
"%[Visibility]@ %[Visible or Invisible]@" = "%1$[可见性]@ %2$[可见或不可见]@";
"%[Visibility]@ %[Visible Items]@" = "%1$[可见性]@ %2$[可见项]@";
"%[Visibility]@ %[Invisible Items]@" = "%1$[可见性]@ %2$[不可见项]@";

